{
    "github": {//settings used to generate your github resume
        "user": "megawac", //if falsy we'll guess

        "include repos": true,
        "include pulls": true, //attempt to find your pull requests (requires a lot of requests with current github api)
        "include unmerged pulls": false,
        
        //Sorting weights. The weights are multiplied by the corresponding repo value in order to sort your repos
        "sort repo weights": {
            "stars": 1,
            "watchers": 1,
            "commits": 0,
            "activity": 0 //days since last commit
        },
        "sort pull weights": {
            "stars": 1,
            "watchers": 1,
            "commits": 10,
            "activity": 0
        }, //How to sort your pull requests (latest 100). Valid options are ["stars", "commits", "activity"]

        "max organizations": 10,
        "max contributions": 6,
        "max repos": 6,

        "exclude repos": ["cdnjs", "jsdelivr", "megawac.github.io"]//repos to exclude by repo name
    },

    //most of these are optional beside some of the obvious
    "name": "Graeme J. Yeates",
    "title": "Geospatial Engineer / Robotics Visualization Specialist",
    "phone": "(418) 587-3258",
    "contact": "yeatesgreame@gmail.com",
    "portfolio": "www.github.com/megawac",
    "objective": "Geospatial engineer with 10 years' experience building real-time visualization and telemetry systems for warehouse robotics. Experienced in architecting fleet↔server synchronization, designing robotic controller interfaces, and creating operational dashboards that improve visibility and decision-making. Skilled in spatial data modeling, streaming telemetry, and performance optimization for large-scale automation deployments.",
    "social": [
        {
            "link": "https://github.com/megawac",
            "name": "github.com/megawac"
        },
        {
            "link": "mail://yeatesgreame@gmail.com",
            "name": "yeatesgreame@gmail.com"
        },
        {
            "link": "tel://4185873258",
            "name": "(418) 587-3258"
        }
    ],
    "skills": [
        "JS/TS",
        "Geospatial engineering",
        "Managing telemetry",
        "Robot Operating System (ROS)",
        "Python",
        "C++",
        "AI/ML workflows",
        "R",
        "Testing & CI workflows",
        "SQL&NoSQL databases",
        "Kubernetes"
    ],
    "frameworks": [
        "React",
        "OpenLayers",
        "Mapbox",
        "Antd",
        "Node",
        "socket.io"
    ],
    "projects": [
        {
            "name": "MutationObserver.js",
            "technologies": "QUnit, Sauce Labs",
            "description": "This is an early work of mine for a Marionette project which I am still very proud of. Created a (reasonably) compliant and well optimized shim of the HTML5 MutationObserver using a novel tree reconciliation algorithm. Followed TDD with an extensive suite of tests across a large suite of browsers."
        },
         {
            "name": "QwebIRC",
            "technologies": "socket.io, Express, underscore, Mootools",
            "description": "This was an IRC client I developed in University for my friends. I completely reimplemented the front end with many enhancements, had a new backend in node following RFC2813, and adjusted all connections to go through the new backend."
        },
         {
            "name": "snowve",
            "technologies": ["C++", "lua", "grafana"],
            "description": "A competitive mod I maintain for Civilization 5. I've implemented many new features, including an analytics engine with grafana dashboards."
         }
    ],
    "experience": [
        {
            "company": "Clearpath/OTTO Motors/Rockwell Automation",
            "title": "Senior Software Engineer",
            "startDate": "May 2016",
            "endDate": "October 2025",
            "technologies": "React, Openlayers, Mapbox, Antd, JS/TS, Python, C++, Kubernetes, Grafana",
            "responsibilities": "I designed and implemented mapping solutions to visualize real time telemetry for large fleets. Created advanced vector interactions to configure how vehicles navigate facilities. Implemented and maintained data synchronization, history management solutions, and various other components of OTTO's fleet management system. I worked closely with product managers and designers on scoping our releases and budgeting customer requests.",
            "achievements": "I mentored several developers and had a significant impact on the team's technical directions. I performed performance audits to allow our fleet management system to scale to handle data from hundreds of vehicles in real time."
        },
        {
            "company": "Majik Systems",
            "title": "Software Engineer",
            "startDate": "October 2015",
            "endDate": "May 2016",
            "technologies": "Marionette, socket.io, MongoDB",
            "responsibilities": "I created synchronization services to ensure Backbone and Marionette models stayed in sync with a socket.io server.",
            "achievements": "I ensured our service could be provided on at least 100 concurrent plc connections feeding vast analytics data to the front end."
        },
        {
            "company": "Echostream (future by Clearpath)",
            "title": "Applications Developer/Surveyor",
            "startDate": "May 2014",
            "endDate": "December 2014",
            "technologies": "ArcGIS, JS, Python, ROS, Leaflet, SQL, HyPack",
            "responsibilities": "Conducted bathymetric surveys using unmanned surface vehicles (USV). I processed survey data from client surveyors using our USVs for conducting bathymetric surveys.",
            "achievements": "I implemented the algorithms to process bathymetric survey data into triangulated irregular networks. Documented the key criteria of what an ideal hydrographic software should offer surveyors using USVs. I created a remote control application for controlling any OTTO vehicle from a web app."
        },
        {
            "company": "CESI Environment Canada",
            "link": "http://maps-cartes.ec.gc.ca/indicators-indicateurs",
            "title": "Geomatics Applications Developer",
            "startDate": "January 2013",
            "endDate": "May 2013",
            "technologies": "ASP.net, VB, SQL, ArcGIS SDKs, ArcGIS Online, jQuery, dojo, CSS3, HTML5",
            "responsibilities": "Created various AJAX service end points and developed administration pages in ASP.NET. Refined the processes of merging contents of a client's file geodatabases into the CESI Microsoft SQL server database. Refactored the air toxics and emissions indicator 'data entities' and added new layers data validation.",
            "achievements": "Participated in a group in a working group responsible for creating a standard web mapping platform (RAMP) for various CESI projects. Mainly worked on implementing localization and transfering state data. Removed serious security holes in the public web services."
        }, {
            "company": "Casgrain & Company Limited",
            "title": "IT Intern",
            "startDate": "May 2012",
            "endDate": "August 2012",
            "technologies": "Java, SQL",
            "responsibilities": "Built custom, data driven financial applications using Java for coworkers. These applications had to keep up to date with multiple, periodically updated SQL databases on foreign servers. Respond to technical questions and provide solutions to problems.",
            "achievements": "Commensed merge of a large Microsoft Access 2000 database into a Microsoft SQL 2005 server. Created and maintained several SQL databases."
        }
    ],
    "education": [
        {
            "institute": "University of Waterloo",
            "startDate": "2011",
            "endDate": "2016",
            "program": "Geomatics with Computer Science minor",
            "achievements": "Dean's list from 2011-2014"
        }
    ],
    "lastupdate": "2025-10-10",
    "resume": "http://megawac.github.io"
}